Repository: azizbibitov/designSwiftUI
Catalog: DesignScreens/SupportingFiles/*.lproj/Localizable.strings
Languages: ru

source: Nice to meet you, %@!
ru: Приятно познакомиться, %@!

source: What is your
ru: Какой у вас

source: gender
ru: пол

source: When is your
ru: Когда твой

source: birthday
ru: день рождения

# What_is_your_height
source: What is your
ru: Какaя у вас

# What_is_your_weight
source: What is your
ru: Какой у вас

source: height
ru: высота

source: weight
ru: вес

# main_goals_asks
source: What is your main goal?
ru: Какова ваша главная цель?

# lose_weight_desc
source: This goal focuses on regular exercise to stimulate weight loss. Our progress trackers help monitor your journey towards a lighter, fitter you.
ru: Эта цель направлена на регулярные физические упражнения для стимулирования снижения веса. Наши трекеры прогресса помогают отслеживать ваш путь к тому, чтобы стать легче и стройнее.

source: Build muscle
ru: Накачать мышцы

# build_muscle_desc
source: This goal is designed for those aiming to gain lean muscle mass. It incorporates structured, high-intensity workout routines to fuel muscle growth.
ru: Эта цель предназначена для тех, кто стремится набрать сухую мышечную массу. Она включает в себя структурированные высокоинтенсивные тренировки для стимулирования роста мышц.

source: Mental wellness
ru: Психическое здоровье

# mental_wellness_desc
source: A holistic approach towards mental health! This goal includes mindfulness activities, stress management techniques, and light exercise routines
ru: Комплексный подход к психическому здоровью! Эта цель включает в себя упражнения на осознанность, методы управления стрессом и легкие упражнения

# injury_recovery_desc
source: I will guide you safely back to your regular activities, optimizing the recovery process and minimizing the risk of re-injury.
ru: Я безопасно верну вас к вашей обычной деятельности, оптимизируя процесс восстановления и сводя к минимуму риск повторной травмы.

source: Hi!
ru: Привет!

# personal_coach
source: I am your personal coach. Please answer some question to get personalized plans.
ru: Я ваш личный тренер. Пожалуйста, ответьте на несколько вопросов, чтобы получить индивидуальные планы.

# iam_ready
source: I’M READY
ru: Я ГОТОВ

source: Profile Details
ru: Детали профиля

# lifestyle_and_goals
source: Lifestyle & Goals
ru: Образ жизни и цели

source: Sign in to your existing account
ru: Войдите в существующую учетную запись

source: Basic Details
ru: Основные сведения

source: Next
ru: Далее

# _others_
source: Others / I’d rather not say
ru: Другие / Не скажу

# adjust_workouts
source: We will adjust our workouts to best suit your age, give rewards for your progress, and more!
ru: Мы адаптируем наши тренировки в соответствии с вашим возрастом, вознаграждаем за ваш прогресс и т.д.!

source: Your Current Body Mass Index
ru: Ваш текущий индекс массы тела

# amazing_bmi
source: Amazing! A little bit more sweat and you will have a perfect BMI!
ru: Потрясающе! Еще немного пота и у вас будет идеальный ИМТ!
